Examinator/src/DataProcessors/РасписаниеПоАудиториямСУО/РасписаниеПоАудиториямСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РасписаниеПоАудиториямСУО</name>
</mdclass:DataProcessor>

Examinator/src/InformationRegisters/ИспользованиеАудиторийСУО/ИспользованиеАудиторийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИспользованиеАудиторийСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияИспользования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Территория</name>
    <type>
      <types>CatalogRef.ТерриторииСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.АудиторииСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/DataProcessors/РасписаниеПоАудиториямСУО/Forms/ИспользованиеАудиторий/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ДобавитьАудиторииВДиаграмму(СтрокиДереваАудиторий, ВыборкаДанныхРасписания, Серия, Родитель=Неопределено, ТаблицаСвязейИнтервалов)
	
	Для каждого Строка Из СтрокиДереваАудиторий Цикл
		
		Если (Родитель = Неопределено ИЛИ ТипЗнч(Родитель) = Тип("СправочникСсылка.ТерриторииСУО"))
			И Родитель <> Строка.Территория Тогда
			
			// Создаем точку для территории
			
			НоваяТочка = Расписание.УстановитьТочку(Строка.Территория); 
			Родитель   = Строка.Территория;
			
			Расписание.РазвернутьТочку(НоваяТочка, Истина);
			
		КонецЕсли;
		
		НоваяТочка = Расписание.УстановитьТочку(Строка.Аудитория, Родитель); 
		ЗначениеДиаграммы = Расписание.ПолучитьЗначение(НоваяТочка, Серия);
		
		СтруктураПоиска = Новый Структура("Аудитория", Строка.Аудитория);
		
		ВыборкаДанныхРасписания.Сбросить();
		
		Пока ВыборкаДанныхРасписания.НайтиСледующий(СтруктураПоиска) Цикл
			
			// Создаем интервал
			
			Интервал = ЗначениеДиаграммы.Добавить();
			Интервал.Начало = ВыборкаДанныхРасписания.ДатаНачалаПроведения;
			Интервал.Конец = Интервал.Начало + ВыборкаДанныхРасписания.ПродолжительностьВСекундах;
			Интервал.Расшифровка = ВыборкаДанныхРасписания.ПроведениеОбучения;
			
			// Заполняем таблицу интервалов для их последующего использования
			
			НоваяСтрока = ТаблицаСвязейИнтервалов.Добавить();
			НоваяСтрока.ПроведениеОбучения = ВыборкаДанныхРасписания.ПроведениеОбучения;
			НоваяСтрока.ДатаНачалаПроведения = ВыборкаДанныхРасписания.ДатаНачалаПроведения;
			НоваяСтрока.Интервал = Интервал;
			
		КонецЦикла;
		
		ДобавитьАудиторииВДиаграмму(Строка.Строки, ВыборкаДанныхРасписания, Серия, Строка.Аудитория, ТаблицаСвязейИнтервалов); // Рекурсия
		
		Расписание.РазвернутьТочку(НоваяТочка, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьРасписаниеПоАудиториям()
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Текст = НСтр("ru = 'Период не задан'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
	КонецЕсли;
	
	Расписание.Очистить();
	
	// Устанавливаем масштаб
	
	Расписание.АвтоОпределениеПолногоИнтервала = Ложь;
	Расписание.УстановитьПолныйИнтервал(Период.ДатаНачала, Период.ДатаОкончания);
	
	// Добавляем шкалы
	
	Шкалы = Расписание.ОбластьПостроения.ШкалаВремени.Элементы;
	
	Для каждого Шкала Из Шкалы Цикл
		Шкалы.Удалить(Шкала);
	КонецЦикла;
	
	// Примечание: нельзя удалить все шкалы, поэтому в дальнейшем основную шкалу получаем ее индексу.
	
	Если Масштаб = "Месяц" Тогда
		
		НоваяШкалаВремени = Расписание.ОбластьПостроения.ШкалаВремени.Элементы.Получить(0);
		НоваяШкалаВремени.Единица = ТипЕдиницыШкалыВремени.Год;
		
		НоваяШкалаВремени = Расписание.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
		НоваяШкалаВремени.Единица = ТипЕдиницыШкалыВремени.Месяц;
		
	КонецЕсли;
	
	Если Масштаб = "Неделя" Тогда
		
		НоваяШкалаВремени = Расписание.ОбластьПостроения.ШкалаВремени.Элементы.Получить(0);
		НоваяШкалаВремени.Единица = ТипЕдиницыШкалыВремени.Месяц;
		
		НоваяШкалаВремени = Расписание.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
		НоваяШкалаВремени.Единица = ТипЕдиницыШкалыВремени.Неделя;
		
	КонецЕсли;
	
	Если Масштаб = "День" Тогда
		
		НоваяШкалаВремени = Расписание.ОбластьПостроения.ШкалаВремени.Элементы.Получить(0);
		НоваяШкалаВремени.Единица = ТипЕдиницыШкалыВремени.Месяц;
		
		НоваяШкалаВремени = Расписание.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
		НоваяШкалаВремени.Единица = ТипЕдиницыШкалыВремени.День;
		
	КонецЕсли;
	
	
	Если Масштаб = "Час" Тогда
		
		НоваяШкалаВремени = Расписание.ОбластьПостроения.ШкалаВремени.Элементы.Получить(0);
		НоваяШкалаВремени.Единица = ТипЕдиницыШкалыВремени.День;
		
		НоваяШкалаВремени = Расписание.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
		НоваяШкалаВремени.Единица = ТипЕдиницыШкалыВремени.Час;
		
	КонецЕсли;
	
	
	Если Масштаб = "Минута" Тогда
		
		НоваяШкалаВремени = Расписание.ОбластьПостроения.ШкалаВремени.Элементы.Получить(0);
		НоваяШкалаВремени.Единица = ТипЕдиницыШкалыВремени.День;
		
		НоваяШкалаВремени = Расписание.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
		НоваяШкалаВремени.Единица = ТипЕдиницыШкалыВремени.Час;
		
		НоваяШкалаВремени = Расписание.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
		НоваяШкалаВремени.Единица = ТипЕдиницыШкалыВремени.Минута;
		НоваяШкалаВремени.Кратность = 5;
		
	КонецЕсли;
	
	// Добавляем серии

	СерияУчебноеВремя = Расписание.УстановитьСерию("Учебное время");
	
	// Добавляем точки
	
	Если ЗначениеЗаполнено(Параметры.Аудитория) Тогда
		
		ДеревоАудиторий = Новый ДеревоЗначений();
		ДеревоАудиторий.Колонки.Добавить("Аудитория");
		ДеревоАудиторий.Колонки.Добавить("Территория");
		
		НоваяАудитория = ДеревоАудиторий.Строки.Добавить();
		НоваяАудитория.Аудитория  = Параметры.Аудитория;
		НоваяАудитория.Территория = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Аудитория, "Владелец");
		
	ИначеЕсли  ЗначениеЗаполнено(Параметры.Территория) Тогда
 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	АудиторииСУО.Ссылка КАК Аудитория,
			|	АудиторииСУО.Владелец КАК Территория
			|ИЗ
			|	Справочник.АудиторииСУО КАК АудиторииСУО
			|ГДЕ
			|	АудиторииСУО.ПометкаУдаления = ЛОЖЬ
			|	И АудиторииСУО.Владелец = &Территория
			|
			|УПОРЯДОЧИТЬ ПО
			|	Аудитория ИЕРАРХИЯ";

		Запрос.Параметры.Вставить("Территория", Параметры.Территория);
			
		Результат = Запрос.Выполнить();

		ДеревоАудиторий = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	АудиторииСУО.Ссылка КАК Аудитория,
			|	АудиторииСУО.Владелец КАК Территория
			|ИЗ
			|	Справочник.АудиторииСУО КАК АудиторииСУО
			|ГДЕ
			|	АудиторииСУО.ПометкаУдаления = ЛОЖЬ
			|
			|УПОРЯДОЧИТЬ ПО
			|	Территория,
			|	Аудитория ИЕРАРХИЯ";

		Результат = Запрос.Выполнить();

		ДеревоАудиторий = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИспользованиеАудиторийСУО.Регистратор КАК ПроведениеОбучения,
		|	ИспользованиеАудиторийСУО.Аудитория,
		|	ИспользованиеАудиторийСУО.Период КАК ДатаНачалаПроведения,
		|	ИспользованиеАудиторийСУО.ПродолжительностьВСекундах,
		|	ИспользованиеАудиторийСУО.Территория
		|ИЗ
		|	РегистрСведений.ИспользованиеАудиторийСУО КАК ИспользованиеАудиторийСУО
		|ГДЕ
		|	ИспользованиеАудиторийСУО.Период МЕЖДУ &ПериодНачало И &ПериодКонец";

	Запрос.УстановитьПараметр("ПериодНачало", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ПериодКонец", Период.ДатаОкончания);

	Если ЗначениеЗаполнено(Параметры.Территория) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		| И ИспользованиеАудиторийСУО.Территория = &Территория";
		
		Запрос.УстановитьПараметр("Территория", Параметры.Территория);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Аудитория) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		| И ИспользованиеАудиторийСУО.Аудитория = &Аудитория";
		
		Запрос.УстановитьПараметр("Аудитория", Параметры.Аудитория);
		
	КонецЕсли;
	
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	ТаблицаСвязейИнтервалов = Новый ТаблицаЗначений;
	ТаблицаСвязейИнтервалов.Колонки.Добавить("ПроведениеОбучения");
	ТаблицаСвязейИнтервалов.Колонки.Добавить("ДатаНачалаПроведения");
	ТаблицаСвязейИнтервалов.Колонки.Добавить("Интервал");
	
	ДобавитьАудиторииВДиаграмму(ДеревоАудиторий.Строки, ВыборкаДетальныеЗаписи, СерияУчебноеВремя, Неопределено, ТаблицаСвязейИнтервалов);
	
	// Устанавливаем связи между интервалами
	
	ТаблицаСвязейИнтервалов.Сортировать("ПроведениеОбучения, ДатаНачалаПроведения");
	
	
	ТекущееПроведениеОбучения = Неопределено;
	РодительскийИнтервал = Неопределено;
	
	Для каждого Строка Из ТаблицаСвязейИнтервалов Цикл
	
		Если ТекущееПроведениеОбучения <> Строка.ПроведениеОбучения Тогда
			ТекущееПроведениеОбучения = Строка.ПроведениеОбучения;
			РодительскийИнтервал         = Строка.Интервал;
		КонецЕсли;
		
		Если Строка.ПроведениеОбучения = ТекущееПроведениеОбучения
			И РодительскийИнтервал <> Строка.Интервал Тогда
			
			РодительскийИнтервал.Добавить(Строка.Интервал);
			РодительскийИнтервал = Строка.Интервал;
			
		КонецЕсли;
	
	КонецЦикла;
	
	// Обновляем таблицу
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИспользованиеАудиторий, "ПериодНачало", Период.ДатаНачала); 
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИспользованиеАудиторий, "ПериодКонец", Период.ДатаОкончания);
	
	Если ЗначениеЗаполнено(Параметры.Аудитория) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИспользованиеАудиторий, "Аудитория", Параметры.Аудитория);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Территория) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИспользованиеАудиторий, "Территория", Параметры.Территория);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Читаем настройки
	
	ДанныеНастроек = ХранилищеСистемныхНастроек.Загрузить(ИмяФормы+"/ТекущиеДанные");
	
	Если ДанныеНастроек <> Неопределено Тогда
		Масштаб = ДанныеНастроек.Получить("Масштаб");
		Период  = ДанныеНастроек.Получить("Период");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Период) Тогда
		Период = Параметры.Период; // Период в параметре имеет большую важность
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Масштаб) Тогда
		Масштаб = "День";
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Период.Вариант = ВариантСтандартногоПериода.ЭтаНеделя;
	КонецЕсли;
	
	// Задаем облать построения диаграммы
	
	Расписание.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.Авто;
	
	// Формируем диаграмму Ганта и таблицу
	
	СформироватьРасписаниеПоАудиториям();	
	
	// Заголовок
	
	Если ЗначениеЗаполнено(Параметры.Аудитория)
		ИЛИ ЗначениеЗаполнено(Параметры.Территория) Тогда
		
		АвтоЗаголовок = Ложь;
		Заголовок     = НСтр("ru = 'Расписание по аудиториям (установлен дополнительный отбор)'");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Параметры.Период) Тогда
		Период = Параметры.Период;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	СформироватьРасписаниеПоАудиториям();
КонецПроцедуры

&НаКлиенте
Процедура МасштабПриИзменении(Элемент)
	СформироватьРасписаниеПоАудиториям();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРасписание(Команда)
	СформироватьРасписаниеПоАудиториям();
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеВыбор(Элемент, Значения, СтандартнаяОбработка, Дата)
	
	Если ТипЗнч(Значения) = Тип("Массив")
		И Значения.Количество() > 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Масштаб = "Месяц" Тогда
		ОкругленнаяДата = НачалоДня(Дата);
	КонецЕсли;
	
	Если Масштаб = "Неделя" Тогда
		ОкругленнаяДата = НачалоДня(Дата);
	КонецЕсли;
	
	Если Масштаб = "День" Тогда
		ОкругленнаяДата = НачалоДня(Дата);
	КонецЕсли;
	
	Если Масштаб = "Час" Тогда
		ОкругленнаяДата = НачалоЧаса(Дата);
	КонецЕсли;
	
	Если Масштаб = "Минута" Тогда
		ОкругленнаяДата = НачалоМинуты(Дата);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("ДатаНачалаПроведения", ОкругленнаяДата));
	
	Если ТипЗнч(Значения) = Тип("ЗначениеДиаграммыГанта") Тогда
		ПараметрыФормы.ЗначенияЗаполнения.Вставить("Аудитория", Значения.Точка.Значение);
	КонецЕсли;
	
	ОткрытьФорму("Документ.ПроведениеОбученияСУО.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
